cassio-lazaro/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
        const std::array streamToTCIF
        {
#ifdef DMA_CFCR_TCF
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
            DMA_CFCR_TCF,
#else
            DMA_FLAG_TC1,
            DMA_FLAG_TC2,
            DMA_FLAG_TC3,
            DMA_FLAG_TC4,
            DMA_FLAG_TC5,
            DMA_FLAG_TC6,
#if defined(DMA_FLAG_TC7)
            DMA_FLAG_TC7,
#endif
#if defined(DMA_FLAG_TC8)
            DMA_FLAG_TC8,
#endif
#endif
        };
        const std::array streamToHTIF
        {
#ifdef DMA_CFCR_HTF
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
            DMA_CFCR_HTF,
#else
            DMA_FLAG_HT1,
            DMA_FLAG_HT2,
            DMA_FLAG_HT3,
            DMA_FLAG_HT4,
            DMA_FLAG_HT5,
            DMA_FLAG_HT6,
#if defined(DMA_FLAG_HT7)
            DMA_FLAG_HT7,
#endif
#if defined(DMA_FLAG_HT8)
            DMA_FLAG_HT8,
#endif
#endif
        };
        const std::array streamToTEIF
        {
#ifdef DMA_CFCR_DTEF
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
            DMA_CFCR_DTEF,
#else
            DMA_FLAG_TE1,
            DMA_FLAG_TE2,
            DMA_FLAG_TE3,
            DMA_FLAG_TE4,
            DMA_FLAG_TE5,
            DMA_FLAG_TE6,
#if defined(DMA_FLAG_TE7)
            DMA_FLAG_TE7,
#endif
#if defined(DMA_FLAG_TE8)
            DMA_FLAG_TE8,
#endif
#endif
        };
#endif

        // clang-format on
        static_assert(dmaISR[0].size() == dmaIFCR[0].size());
        static_assert(dmaISR[0].size() == DmaChannel[0].size());
        static_assert(dmaISR[0].size() == dmaIrq[0].size());
        static_assert(dmaISR[0].size() == streamToTCIF.size());
        static_assert(dmaISR[0].size() == streamToHTIF.size());
        static_assert(dmaISR[0].size() == streamToTEIF.size());

        uint32_t dummy;
    }

    DmaStm::DmaStm()
    {
#if defined(__HAL_RCC_GPDMA1_CLK_ENABLE)
        __HAL_RCC_GPDMA1_CLK_ENABLE();
#else
        __DMA1_CLK_ENABLE();
        __DMA2_CLK_ENABLE();
#if defined(__HAL_RCC_DMAMUX1_CLK_ENABLE)
        __HAL_RCC_DMAMUX1_CLK_ENABLE();
#endif
#endif
    }

    DmaStm::~DmaStm()
    {
#if defined(__HAL_RCC_GPDMA1_CLK_DISABLE)
        __HAL_RCC_GPDMA1_CLK_DISABLE();
#else
        __DMA1_CLK_DISABLE();
        __DMA2_CLK_DISABLE();
#if defined(__HAL_RCC_DMAMUX1_CLK_DISABLE)
        __HAL_RCC_DMAMUX1_CLK_DISABLE();
#endif
#endif
    }

    void DmaStm::ReserveStream(uint8_t dmaIndex, uint8_t streamIndex)
    {
        really_assert((streamAllocation[dmaIndex] & (1 << streamIndex)) == 0);
        streamAllocation[dmaIndex] |= 1 << streamIndex;
    }

    void DmaStm::ReleaseStream(uint8_t dmaIndex, uint8_t streamIndex)
    {
        streamAllocation[dmaIndex] &= ~(1 << streamIndex);
    }

    DmaStm::Stream::Stream(DmaStm& dma, DmaChannelId channelId)
        : dma(dma)
        , dmaIndex(channelId.dma)
#ifdef DMA_CTR2_REQSEL
        , dmaMux(channelId.mux)
#endif

#if defined(DMA_STREAM_BASED)
        , streamIndex(channelId.stream)
#else
        , streamIndex(channelId.channel)
#endif
    {
        dma.ReserveStream(dmaIndex, streamIndex);
        DMA_HandleTypeDef DmaChannelHandle = {};

#if defined(DMA_LINKEDLIST)
        DMA_QListTypeDef dmaQueue;
        DMA_NodeConfTypeDef pNodeConfig;
        DMA_NodeTypeDef nodeTx;
        DmaChannelHandle.Instance = DmaChannel[dmaIndex][streamIndex];
        DmaChannelHandle.InitLinkedList.Priority = DMA_LOW_PRIORITY_MID_WEIGHT;
        DmaChannelHandle.InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
        DmaChannelHandle.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
        DmaChannelHandle.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
        DmaChannelHandle.InitLinkedList.LinkedListMode = DMA_LINKEDLIST_CIRCULAR;
        really_assert(HAL_DMAEx_List_Init(&DmaChannelHandle) == 0);
        really_assert(HAL_DMA_ConfigChannelAttributes(&DmaChannelHandle, DMA_CHANNEL_NPRIV) == 0);
#else
        DmaChannelHandle.Instance = DmaChannel[dmaIndex][streamIndex];

        DmaChannelHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
        DmaChannelHandle.Init.PeriphInc = DMA_PINC_DISABLE;
        DmaChannelHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
        DmaChannelHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
        DmaChannelHandle.Init.Mode = DMA_NORMAL;
        DmaChannelHandle.Init.Priority = DMA_PRIORITY_MEDIUM;
#if defined(DMA_STREAM_BASED)
        DmaChannelHandle.Init.Channel = dmaChannel[channelId.channel];
        DmaChannelHandle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        DmaChannelHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        DmaChannelHandle.Init.MemBurst = DMA_MBURST_SINGLE;
        DmaChannelHandle.Init.PeriphBurst = DMA_PBURST_SINGLE;
#else
        DmaChannelHandle.Init.Request = channelId.mux;
#endif
        HAL_DMA_Init(&DmaChannelHandle);
#endif
    }

    DmaStm::Stream::~Stream()
    {
        if (streamIndex != 0xff)
            dma.ReleaseStream(dmaIndex, streamIndex);
    }

    DmaStm::Stream::Stream(Stream&& other) noexcept
        : dma(other.dma)
        , dmaIndex(other.dmaIndex)
        , streamIndex(other.streamIndex)
    {
        other.streamIndex = 0xff;
    }

    DmaStm::Stream& DmaStm::Stream::operator=(Stream&& other)
    {
        dmaIndex = other.dmaIndex;
        streamIndex = other.streamIndex;

        other.streamIndex = 0xff;

        return *this;
    }

    uint8_t DmaStm::Stream::DataSize() const
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_MSIZE)
        return 1 << ((streamRegister->CR & DMA_SxCR_MSIZE) >> POSITION_VAL(DMA_SxCR_MSIZE));
#elif defined(DMA_CTR1_DDW_LOG2)
        return 1 << ((streamRegister->CTR1 & DMA_CTR1_DDW_LOG2) >> POSITION_VAL(DMA_CTR1_DDW_LOG2));
#else
        return 1 << ((streamRegister->CCR & DMA_CCR_MSIZE) >> POSITION_VAL(DMA_CCR_MSIZE));
#endif
    }

    void DmaStm::Stream::SetDataSize(uint8_t dataSizeInBytes)
    {
        SetPeripheralDataSize(dataSizeInBytes);
        SetMemoryDataSize(dataSizeInBytes);
    }

    void DmaStm::Stream::SetPeripheralDataSize(uint8_t dataSizeInBytes)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];

#if defined(DMA_SxCR_PSIZE)
        streamRegister->CR = (streamRegister->CR & ~DMA_SxCR_PSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_SxCR_PSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_SxCR_PSIZE_1 : 0);
#elif defined(DMA_CTR2_DREQ)
        dataSizeInBytes &= 0x03;
        uint32_t mask{ 0 };
        if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY) && (streamRegister->CTR2 & DMA_MEMORY_TO_PERIPH))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_DDW_LOG2_Pos;
        else if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_SDW_LOG2_Pos;

