cassio-lazaro/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
        streamRegister->CTR1 = (streamRegister->CTR1 & ~mask) | (streamRegister->CTR1 | mask);
#else
        streamRegister->CCR = (streamRegister->CCR & ~DMA_CCR_PSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_CCR_PSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_CCR_PSIZE_1 : 0);
#endif
    }

    void DmaStm::Stream::SetMemoryDataSize(uint8_t dataSizeInBytes)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_MSIZE)
        streamRegister->CR = (streamRegister->CR & ~DMA_SxCR_MSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_SxCR_MSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_SxCR_MSIZE_1 : 0);
#elif defined(DMA_CTR2_DREQ)
        dataSizeInBytes &= 0x03;
        uint32_t mask{ 0 };
        if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY) && (streamRegister->CTR2 & DMA_MEMORY_TO_PERIPH))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_SDW_LOG2_Pos;
        else if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY))
            mask = (dataSizeInBytes >> 1) << DMA_CTR1_DDW_LOG2_Pos;

        streamRegister->CTR1 = (streamRegister->CTR1 & ~mask) | (streamRegister->CTR1 | mask);
#else
        streamRegister->CCR = (streamRegister->CCR & ~DMA_CCR_MSIZE) | ((dataSizeInBytes & 1) == 0 ? DMA_CCR_MSIZE_0 : 0) | (dataSizeInBytes > 2 ? DMA_CCR_MSIZE_1 : 0);
#endif
    }

    bool DmaStm::Stream::StopTransfer()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
        bool finished = Finished();
        DisableHalfTransferCompleteInterrupt();
        DisableTransferCompleteInterrupt();
        Disable();
        *dmaIFCR[dmaIndex][streamIndex] |= streamToTCIF[streamIndex] | streamToHTIF[streamIndex];
        return !finished;
    }

    void DmaStm::Stream::Disable()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_EN)
        streamRegister->CR &= ~DMA_SxCR_EN;
#else
        streamRegister->CCR &= ~DMA_CCR_EN;
#endif
    }

    void DmaStm::Stream::DisableHalfTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_HTIE)
        streamRegister->CR &= ~DMA_IT_HT;
#else
        streamRegister->CCR &= ~DMA_IT_HT;
#endif
    }

    void DmaStm::Stream::DisableMemoryIncrement()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_MINC)
        streamRegister->CR &= ~DMA_MINC_ENABLE;
#elif defined(STM32WBA)
        streamRegister->CTR1 &= (!(streamRegister->CTR2 & DMA_CTR2_SWREQ) && (streamRegister->CTR2 & DMA_CTR2_DREQ)) ? ~DMA_CTR1_SINC : ~DMA_CTR1_DINC;
#else
        streamRegister->CCR &= ~DMA_MINC_ENABLE;
#endif
    }

    void DmaStm::Stream::DisableTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_TCIE)
        streamRegister->CR &= ~DMA_IT_TC;
#else
        streamRegister->CCR &= ~DMA_IT_TC;
#endif
    }

    void DmaStm::Stream::DisableCircularMode()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_CIRC)
        streamRegister->CR &= ~DMA_SxCR_CIRC;
#elif defined(DMA_TCEM_EACH_LL_ITEM_TRANSFER)
        streamRegister->CLLR &= 0;
#else
        streamRegister->CCR &= ~DMA_CCR_CIRC;
#endif
    }

    void DmaStm::Stream::Enable()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_EN)
        streamRegister->CR |= DMA_SxCR_EN;
#else
        streamRegister->CCR |= DMA_CCR_EN;
#endif
    }

    void DmaStm::Stream::EnableHalfTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_HTIE)
        streamRegister->CR |= DMA_IT_HT;
#else
        streamRegister->CCR |= DMA_IT_HT;
#endif
    }

    void DmaStm::Stream::EnableMemoryIncrement()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_MINC)
        streamRegister->CR |= DMA_MINC_ENABLE;
#elif defined(STM32WBA)
        streamRegister->CTR1 |= (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY) && (streamRegister->CTR2 & DMA_MEMORY_TO_PERIPH)) ? DMA_CTR1_SINC : DMA_CTR1_DINC;
#else
        streamRegister->CCR |= DMA_MINC_ENABLE;
#endif
    }

    void DmaStm::Stream::EnableTransferCompleteInterrupt()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_TCIE)
        streamRegister->CR |= DMA_IT_TC;
#else
        streamRegister->CCR |= DMA_IT_TC;
#endif
    }

    void DmaStm::Stream::EnableCircularMode()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_CIRC)
        streamRegister->CR |= DMA_SxCR_CIRC;
#elif defined(DMA_LINKEDLIST)
        /* Set node configuration ################################################*/
        // DmaChannelHandle.Instance = DmaChannel[dmaIndex][streamIndex];
        // DmaChannelHandle.InitLinkedList.Priority = DMA_LOW_PRIORITY_LOW_WEIGHT;
        // DmaChannelHandle.InitLinkedList.LinkStepMode = DMA_LSM_FULL_EXECUTION;
        // DmaChannelHandle.InitLinkedList.LinkAllocatedPort = DMA_LINK_ALLOCATED_PORT0;
        // DmaChannelHandle.InitLinkedList.TransferEventMode = DMA_TCEM_LAST_LL_ITEM_TRANSFER;
        // DmaChannelHandle.InitLinkedList.LinkedListMode = DMA_LINKEDLIST_CIRCULAR;
        // really_assert(HAL_DMAEx_List_Init(&DmaChannelHandle) == 0);
        // really_assert(HAL_DMA_ConfigChannelAttributes(&DmaChannelHandle, DMA_CHANNEL_NPRIV) == 0);

        
        pNodeConfig.NodeType = DMA_GPDMA_LINEAR_NODE;
        pNodeConfig.Init.Request = GPDMA1_REQUEST_USART1_RX;
        pNodeConfig.Init.BlkHWRequest = DMA_BREQ_SINGLE_BURST;
        pNodeConfig.Init.Direction = DMA_PERIPH_TO_MEMORY;
        pNodeConfig.Init.SrcInc = DMA_SINC_FIXED;
        pNodeConfig.Init.DestInc = DMA_DINC_INCREMENTED;
        pNodeConfig.Init.SrcDataWidth = DMA_SRC_DATAWIDTH_BYTE;
        pNodeConfig.Init.DestDataWidth = DMA_DEST_DATAWIDTH_BYTE;
        pNodeConfig.Init.SrcBurstLength = 1;
        pNodeConfig.Init.DestBurstLength = 1;
        pNodeConfig.Init.TransferAllocatedPort = DMA_SRC_ALLOCATED_PORT0|DMA_DEST_ALLOCATED_PORT0;
        pNodeConfig.Init.TransferEventMode = DMA_TCEM_BLOCK_TRANSFER;
        pNodeConfig.TriggerConfig.TriggerPolarity = DMA_TRIG_POLARITY_MASKED;
        pNodeConfig.DataHandlingConfig.DataExchange = DMA_EXCHANGE_NONE;
        pNodeConfig.DataHandlingConfig.DataAlignment = DMA_DATA_RIGHTALIGN_ZEROPADDED;

        /* Build nodeTx Node */
        really_assert(HAL_DMAEx_List_BuildNode(&pNodeConfig, &nodeTx) == 0);

