cassio-lazaro/amp-hal-st/hal_st/stm32fxxx/DmaStm.cpp
        /* Insert nodeTx to Queue */
        really_assert(HAL_DMAEx_List_InsertNode_Tail(&dmaQueue, &nodeTx) == 0);

        really_assert(HAL_DMAEx_List_SetCircularModeConfig(&dmaQueue, &nodeTx) == 0);

        // really_assert(HAL_DMAEx_List_SetCircularMode(&dmaQueue) == 0);
        
        // really_assert(HAL_DMAEx_List_LinkQ(&DmaChannelHandle, &dmaQueue) == 0);
#else
        streamRegister->CCR |= DMA_CCR_CIRC;
#endif
    }

    bool DmaStm::Stream::Finished() const
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_EN)
        return (streamRegister->CR & DMA_SxCR_EN) == 0;
#else
        return (streamRegister->CCR & DMA_CCR_EN) == 0;

#endif
    }

    void DmaStm::Stream::SetMemoryAddress(const void* memoryAddress)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxM0AR_M0A)
        streamRegister->M0AR = reinterpret_cast<uint32_t>(memoryAddress);
#elif defined(STM32WBA)
        if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY) && (streamRegister->CTR2 & DMA_MEMORY_TO_PERIPH))
            streamRegister->CSAR = reinterpret_cast<uint32_t>(memoryAddress);
        else if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY))
            streamRegister->CDAR = reinterpret_cast<uint32_t>(memoryAddress);
#else
        streamRegister->CMAR = reinterpret_cast<uint32_t>(memoryAddress);
#endif
    }

    void DmaStm::Stream::SetMemoryToPeripheralMode()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_DIR_0)
        streamRegister->CR |= DMA_MEMORY_TO_PERIPH;
#elif defined(STM32WBA)
        streamRegister->CTR2 |= DMA_CTR2_DREQ | (dmaMux & DMA_CTR2_REQSEL);
        streamRegister->CTR2 &= ~DMA_CTR2_SWREQ;
#else
        streamRegister->CCR |= DMA_MEMORY_TO_PERIPH;
#endif
    }

    void DmaStm::Stream::SetPeripheralAddress(volatile void* peripheralAddress)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxPAR_PA)
        streamRegister->PAR = reinterpret_cast<uint32_t>(peripheralAddress);
#elif defined(STM32WBA)
        if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY) && (streamRegister->CTR2 & DMA_MEMORY_TO_PERIPH))
            streamRegister->CDAR = reinterpret_cast<uint32_t>(peripheralAddress);
        else if (!(streamRegister->CTR2 & DMA_MEMORY_TO_MEMORY))
            streamRegister->CSAR = reinterpret_cast<uint32_t>(peripheralAddress);
#else
        streamRegister->CPAR = reinterpret_cast<uint32_t>(peripheralAddress);
#endif
    }

    void DmaStm::Stream::SetPeripheralToMemoryMode()
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxCR_DIR_0)
        streamRegister->CR &= ~DMA_MEMORY_TO_PERIPH;
#elif defined(STM32WBA)
        streamRegister->CTR2 &= ~(DMA_CTR2_DREQ | DMA_CTR2_SWREQ);
        streamRegister->CTR2 |= (dmaMux & DMA_CTR2_REQSEL);
#else
        streamRegister->CCR &= ~DMA_MEMORY_TO_PERIPH;
#endif
    }

    void DmaStm::Stream::SetTransferSize(uint16_t size)
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxNDT)
        streamRegister->NDTR = size / DataSize();
#elif defined(DMA_CBR1_BNDT)
        streamRegister->CBR1 = size / DataSize();
#else
        streamRegister->CNDTR = size / DataSize();
#endif
    }

    bool DmaStm::Stream::IsHalfComplete() const
    {
        return *dmaISR[dmaIndex][streamIndex] & streamToHTIF[streamIndex];
    }

    bool DmaStm::Stream::IsFullComplete() const
    {
        return *dmaISR[dmaIndex][streamIndex] & streamToTCIF[streamIndex];
    }

    void DmaStm::Stream::ClearHalfComplete() const
    {
        *dmaIFCR[dmaIndex][streamIndex] |= streamToHTIF[streamIndex];
    }

    void DmaStm::Stream::ClearFullComplete() const
    {
        *dmaIFCR[dmaIndex][streamIndex] |= streamToTCIF[streamIndex];
    }

    size_t DmaStm::Stream::BytesToTransfer() const
    {
        auto streamRegister = DmaChannel[dmaIndex][streamIndex];
#if defined(DMA_SxNDT)
        return streamRegister->NDTR * DataSize();
#elif defined(DMA_CBR1_BNDT)
        return streamRegister->CBR1 * DataSize();
#else
        return streamRegister->CNDTR * DataSize();
#endif
    }

    void DmaStm::TransceiveStream::StartTransmit(infra::ConstByteRange data)
    {
        SetMemoryToPeripheralMode();
        EnableMemoryIncrement();
        SetTransferSize(data.size());
        SetMemoryAddress(data.begin());
        Enable();
    }

    void DmaStm::TransceiveStream::StartTransmitDummy(uint16_t size)
    {
        SetMemoryToPeripheralMode();
        DisableMemoryIncrement();
        SetTransferSize(size);
        SetMemoryAddress(&dummy);
        Enable();
    }

    void DmaStm::TransceiveStream::StartReceive(infra::ByteRange data)
    {
        this->data = data;
#if not defined(DMA_LINKEDLIST)
        SetPeripheralToMemoryMode();
        EnableMemoryIncrement();
        SetTransferSize(data.size());
        SetMemoryAddress(data.begin());
        Enable();
#endif
    }

    void DmaStm::TransceiveStream::StartReceiveDummy(uint16_t size)
    {
        SetPeripheralToMemoryMode();
        DisableMemoryIncrement();
        SetTransferSize(size);
        SetMemoryAddress(&dummy);
        Enable();
    }

    size_t DmaStm::TransceiveStream::ReceivedSize() const
    {
        return (data.size() - BytesToTransfer()) / DataSize();
    }

    DmaStm::StreamInterruptHandler::StreamInterruptHandler(Stream& stream, const infra::Function<void()>& transferFullComplete)
        : stream{ stream }
        , dispatchedInterruptHandler{ dmaIrq[stream.dmaIndex][stream.streamIndex], [this]
            {
                OnInterrupt();
            } }
        , transferFullComplete{ transferFullComplete }
    {
        stream.DisableCircularMode();
        stream.EnableTransferCompleteInterrupt();
    }

    void DmaStm::StreamInterruptHandler::OnInterrupt()
    {
        if (stream.IsFullComplete())
        {
            stream.ClearFullComplete();

            stream.Disable();

            __DMB();

